<template>
	<view class="agreement">
		<!-- 协议 -->
		<view class="u-tabs-box">
			<u-tabs-swiper activeColor="#303133" :bold="false" inactive-color="#6E7073" ref="tabs" :list="list" height='102'
				:current="current" @change="change" :is-scroll="false" swiperWidth="750" bg-color='#f7f8fa'>
			</u-tabs-swiper>
		</view>

		<swiper class="swiper-box" :current="swiperCurrent" @transition="transition" @animationfinish="animationfinish" style="    min-height: calc(100vh - 51px);">
			<swiper-item>
				<scroll-view scroll-y style="height: 100%; width: 100%;">
					<view class="page-box agreement_content">
						<view class="content_title">{{list[swiperCurrent].title}}</view>
						<view class="content_box" v-for="(item,index) in list[swiperCurrent].child">
							<text class="box_title">{{item.title}}</text>
							<text class="box_content" v-for="(ite,ind) in item.content">{{ite.child}}</text>
						</view>
					</view>

				</scroll-view>
			</swiper-item>
			<!--  -->
			<swiper-item>
				<scroll-view scroll-y style="height: 100%;width: 100%;">
					<view class="page-box agreement_content">
						<view class="content_title">{{list[swiperCurrent].title}}</view>
						<view class="content_box" v-for="(item,index) in list[swiperCurrent].child">
							<text class="box_title">{{item.title}}</text>
							<text class="box_content" v-for="(ite,ind) in item.content">{{ite.child}}</text>
						</view>
					</view>
				</scroll-view>
			</swiper-item>


		</swiper>

		<view class="wrap">
			<u-icon name='arrow-up' color='#fff' size="28px"></u-icon>
			<u-back-top class="wrap" scroll-top="scrollTop">
			</u-back-top>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				scrollTop: 0,
				list: [{
					name: '用户协议',
					title: '莫的问题用户协议',
					child: [{
							title: '1、莫的问题服务条款的接受',
							content: [{
								child: '莫的问题所提供的服务完全按照其发布的服务条款和操作规则。本服务条款所称的用户是指完全同意所有条款并完成注册程序而使用莫的问题服务(以下简称“本服务")的用户。'
							}]
						},
						{
							title: '2、服务条款的变更和修改',
							content: [{
								child: '莫的问题有权随时对服务条款进行修改，并且一旦发生服务条款的变动，莫的问题将在页面上提示修改的内容；当用户使用莫的问题的特殊服务时，应接受莫的问题随时提供的与该特殊服务相关的规则或说明，并且此规则或说明均构成本服务条款的一部分。用户如果不同意服务条款的修改，可以主动取消已经获得的网络服务；如果用户继续享用网络服务，则视为用户已经接受服务条款的修改。'
							}]
						},
						{
							title: '3、服务说明',
							content: [{
									child: '(1)  莫的问题提供的财税一体化平台互联网软件技术服务(以下简称本服务)。除非另有明确规定，增强或强化目前服务的任何新功能，包括新产品，均无条件地适用本服务条款。'
								}, {
									child: '(2)  莫的问题对网络服务不承担任何责任，即用户对网络服务的使用承担风险。莫的问题不保证服务一定会满足用户的使用要求，也不保证服务不会中断，对服务的及时性、安全性、准确性也不作担保。'
								}, {
									child: '(3)  为使用本服务，用户必须：'
								},
								{
									child: 'a. 自行配备接入国际互联网所必需的设备，包括计算机、数据机或其他存取装置；'
								}, {
									child: 'b. 自行支付与此服务有关的费用。'
								}, {
									child: '(4)  用户接受本服务须同意：'
								}, {
									child: 'a. 提供完整、真实、准确、最新的个人资料；'
								}, {
									child: 'b. 经常更新注册资料，以符合上述(4).a的要求。'
								}, {
									child: '若用户提供任何错误、不实的资料，并为莫的问题所确知；或者莫的问题有合理理由怀疑前述资料为错误、不实，莫的问题有权暂停或终止用户的账号。'
								}
							]
						},
						{
							title: '4、用户应遵守以下法律及法规：',
							content: [{
								child: '用户同意遵守《中华人民共和国保守国家秘密法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》等有关计算机及互联网规定的法律和法规、实施办法。在任何情况下，莫的问题合理地认为用户的行为可能违反上述法律、法规，莫的问题可以在任何时候，不经事先通知终止向该用户提供服务。 用户应了解国际互联网的无国界性，应特别注意遵守当地所有有关的法律和法规。'
							}]
						},
						{
							title: '5、用户隐私权制度',
							content: [{
									child: '当用户注册莫的问题的服务时，用户须提供个人信息。莫的问题收集个人信息的目的是为确定用户身份，验证登录用户的合法性。 莫的问题不会在未经合法用户授权时，公开、编辑或透露其个人信息及保存在莫的问题中的非公开内容，除非有下列情况：'
								}, {
									child: '(1)  有关法律规定或莫的问题合法服务程序规定；'
								}, {
									child: '(2)  在紧急情况下，为维护用户及公众的权益；'
								}, {
									child: '(3)  为维护莫的问题的商标权；'
								}, {
									child: '(4)  其他需要公开、编辑或透露个人信息的情况。'
								},

							]
						},
						{
							title: '6、用户账号、密码和安全',
							content: [{
								child: '用户一旦注册成功，便成为莫的问题的合法用户，将得到一个密码和账号。用户有义务保证密码和账号的安全。用户对利用该密码和账号所进行的一切活动负全部责任；因此所衍生的任何损失或损害，莫的问题无法也不负担任何责任。 用户的密码和账号遭到未授权的使用或发生其他任何安全问题，用户可以立即通知莫的问题，并且用户在每次连线结束，应结束账号使用，否则用户可能得不到莫的问题的安全保护。'
							}]
						}, {
							title: '7、对用户信息的存储和限制',
							content: [{
								child: '莫的问题不对用户所发布信息的删除或储存失败负责。莫的问题有权判断用户的行为是否符合莫的问题服务条款规定的权利，如果莫的问题认为用户违背了服务条款的规定，莫的问题有中断向其提供网络服务的权利。'
							}]
						},
						{
							title: '8、禁止用户从事以下行为：',
							content: [{
									child: '(1)  上载、张贴、发送电子邮件或传送任何违反《中华人民共和国保守国家秘密法》、《中华人民共和国计算机信息系统安全保护条例》等法律条例，以及违反公共道德；'
								}, {
									child: '(2)  上载、张贴、发送电子邮件或传送任何非法、有害、胁迫、骚扰、侵害、中伤、粗俗、猥亵、诽谤、淫秽、侵害他人因隐私、种族歧视或其他另人不快的包括但不限于资讯、资料、文字、软件、音乐、照片、图形、信息或其他资料(以下简称内容)；'
								}, {
									child: '(3)  以任何方式危害未成年人；'
								},
								{
									child: '(4)  冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关；'
								},
								{
									child: '(5)  伪造标题或以其他方式操控识别资料，使人误认为该内容为莫的问题所传送；'
								},
								{
									child: '(6)  将无权传送的内容(例如内部资料、机密资料)进行上载、张贴、发送电子邮件或以其他方式传送；'
								},
								{
									child: '(7)  将侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容加以上载、张贴、发送电子邮件或以其他方式传送；'
								},
								{
									child: '(8)  将广告函件、促销资料、“垃圾邮件"等，加以上载、张贴、发送电子邮件或以其他方式传送。供前述目的使用的专用区域除外；'
								},
								{
									child: '(9)  将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送；'
								},
								{
									child: '(10)  干扰或破坏本服务或与本服务相连的服务器和网络，或不遵守本服务网络使用之规定；'
								},
								{
									child: '(11)  故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范；'
								},
								{
									child: '(12)  跟踪或以其他方式骚扰他人。'
								},
								{
									child: '用户对经由本服务上载、张贴、发送电子邮件或传送的内容负全部责任对于经由本服务而传送的内容，莫的问题不保证前述内容的正确性、完整性或品质。用户在接受本服务时，有可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下，莫的问题均不对任何内容负责，包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。莫的问题有权(但无义务)自行拒绝或删除经由本服务提供的任何内容。用户使用上述内容，应自行承担风险。莫的问题有权利在下述情况下，对内容进行保存或披露：'
								},

								{
									child: '(1)  法律程序所规定；'
								},
								{
									child: '(2)  本服务条款规定；'
								},
								{
									child: '(3)  被侵害的第三人提出权利主张；'
								}, {
									child: '(4)  为保护莫的问题、其使用者及社会公众的权利、财产或人身安全；'
								}, {
									child: '(5)  其他莫的问题认为有必要的情况。'
								}
							]
						}, {
							title: '9、关于用户在莫的问题的公开使用区域张贴内容：',
							content: [{
									child: '(1)  “公开使用区域"指一般公众可以使用的区域；'
								},
								{
									child: '(2)  用户在本服务公开的使用区域张贴的内容，则视为用户授权莫的问题免费使用权及非独家使用权，莫的问题有权为展示、散布及推广前述张贴的内容之服务目的，对上述内容进行复制、修改、出版。本使用权持续到用户将上述内容在本服务中删除；'
								},
								{
									child: '(3)  因用户进行上述张贴，而导致任何第三方提出索赔要求或衍生的任何损害或损失，用户承担全部责任。'
								}
							]
						}, {
							title: '10、用户不得对本服务进行复制、出售或用作其他商业用途。'
						}, {
							title: '11、莫的问题有权规定并修改使用本服务的一般措施。'
						}, {
							title: '12、关于链接',
							content: [{
								child: '本服务可能会提供与其他国际互联网网站或资源进行链接。对于前述网站或资源是否可以利用，莫的问题不予担保。因使用或依赖上述网站或资源所生的损失或损害，莫的问题也不负担任何责任。'
							}]
						}, {
							title: '13、莫的问题的知识产权及其他权利',
							content: [{
									child: '(1)  莫的问题对本服务及本服务所使用的软件包含受知识产权或其他法律保护的资料享有相应的权利；'
								},
								{
									child: '(2)  经由本服务传送的资讯及内容，受到著作权法、商标法、专利法或其他法律的保护；未经莫的问题明示授权许可，用户不得进行修改、出租、散布或衍生其他作品；'
								},
								{
									child: '(3)  用户对本服务所使用的软件有非专属性使用权，但自己不得或许可任何第三方复制、修改、出售或衍生产品。'
								}
							]
						}, {
							title: '14、免责声明',
							content: [{
									child: '(1)  莫的问题对于任何包含、经由或连接、下载或从任何与有关本服务所获得的任何内容、信息或广告，不声明或保证其正确性或可靠性；并且对于用户经本服务上的广告、展示而购买、取得的任何产品、信息或资料，莫的问题不负保证责任。用户自行负担使用本服务的风险；'
								},
								{
									child: '(2)  莫的问题有权但无义务，改善或更正本服务任何部分之任何疏漏、错误；'
								},
								{
									child: '(3)  莫的问题不保证(包括但不限于)：'
								}, {
									child: 'a. 本服务适合用户的使用要求；'
								}, {
									child: 'b. 本服务不受干扰，及时、安全、可靠或不出现错误；'
								}, {
									child: 'c. 用户经由本服务取得的任何产品、服务或其他材料符合用户的期望；'
								}, {
									child: 'd. 在不透露隐私资料前提下，莫的问题有权对整个用户数据库进行分析并对用户数据库进行商业上的应用;'
								}, {
									child: '(4)  用户使用经由本服务下载的或取得的任何资料，其风险自行负担；因该使用而导致用户电脑系统损坏或资料流失，用户应负完全责任；'
								}, {
									child: '(5)  基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，莫的问题不承担任何直接、间接、附带、衍生或惩罚性的赔偿：'
								}, {
									child: 'a. 本服务使用或无法使用；'
								}, {
									child: 'b. 经由本服务购买或取得的任何产品、资料或服务；'
								}, {
									child: 'c. 用户资料遭到未授权的使用或修改；'
								}, {
									child: 'd. 同意接受协议，视同授权平台因产品技术需要而进行相关的数据、接口、授权等操作，平台对相关授权及数据有保密义务；'
								}, {
									child: 'e. 其他与本服务相关的事宜。'
								}, {
									child: '(6)  用户在浏览网际网路时自行判断使用莫的问题的检索目录。该检索目录可能会引导用户进入到被认为具有攻击性或不适当的网站，莫的问题没有义务查看检索目录所列网站的内容，因此，对其正确性、合法性、正当性不负任何责任。'
								}
							]
						}, {
							title: '15、由于用户经由本服务张贴或传送内容、与本服务连线、违反本服务条款或侵害其他人的任何权利导致任何第三人提出权利主张，用户同意赔偿莫的问题并使其免受损害。'
						}, {
							title: '16、服务的修改和终止',
							content: [{
								child: '莫的问题有权在任何时候，暂时或永久地修改或终止本服务(或任何一部分)，无论是否通知。莫的问题对本服务的修改或终止对用户和任何第三人不承担任何责任。莫的问题有权基于任何理由，终止用户的账号、密码或使用本服务，或删除、转移用户存储、发布在本服务的内容，莫的问题采取上述行为均不需通知，并且对用户和任何第三人不承担任何责任。'
							}]
						}, {
							title: '17、通知',
							content: [{
								child: '莫的问题向用户发出的通知，采用电子邮件或页面公告或短信息的形式。服务条款的修改或其他事项变更时，莫的问题将会以上述形式进行通知。'
							}]
						}, {
							title: '18、关于付费',
							content: [{
									child: '莫的问题为付费使用产品，所有的功能与服务仅限于付费用户使用。'
								},
								{
									child: '	a. 支付费用采用先付费后使用的方式。'
								},

								{
									child: '	b. 由于莫的问题用户已经提供了充足的试用期，所以我们认为您在付费之前已经对软件足够了解。所以一经付费，不允许退款。'
								},

								{
									child: 'c. 付费后，我们可提供正规发票。请在付款时，注明发票抬头、金额等信息。如果因为提供的发票有误导致开错票，相关责任需要由客户负责。'
								},

								{
									child: 'd. 付费到期后，如果没有及时续费，莫的问题有权停止用户的的使用权。用户之前记录的数据应该在到期前及时导出，以避免数据损失。若未及时导出导致数据丢失，莫的问题不负责任。'
								}
							]
						}, {
							title: '19、法律的适用和管辖',
							content: [{
								child: '本服务条款的生效、履行、解释及争议的解决均适用中华人民共和国法律，发生的争议提交合肥市仲裁委员会，其仲裁裁决是终局的。本服务条款因与中华人民共和国现行法律相抵触而导致部分无效，不影响其他部分的效力。'
							}]
						}

					]
				}, {
					name: '隐私政策',
					title: '莫的问题隐私政策',
					child: [{

							content: [{
									child: '莫的问题小程序尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，莫的问题小程序会按照本隐私权政策的规定使用和披露您的个人信息。但莫的问题小程序将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，莫的问题小程序不会将这些信息对外披露或向第三方提供。莫的问题小程序会不时更新本隐私权政策。'
								},
								{
									child: '您在同意莫的问题小程序服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于莫的问题小程序（以下简称本应用）服务使用协议不可分割的一部分。'
								}
							]

						}, {
							title: '1、适用范围',
							content: [{
								child: '在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；本应用通过合法途径从商业伙伴处取得的用户个人数据。'
							}, {
								child: '您了解并同意，以下信息不适用本隐私权政策：'
							}, {
								child: '您在使用本应用平台提供的搜索服务时输入的关键字信息；'
							}, {
								child: '本应用收集到的您在本应用发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情；'
							}, {
								child: '违反法律规定或违反本应用规则行为及本应用已对您采取的措施。'
							}]
						}, {
							title: '2、信息使用',
							content: [{
									child: '本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和本应用(含本应用关联公司)单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。'
								}, {
									child: '本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。'
								}, {
									child: '为服务用户的目的，本应用可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与本应用合作伙伴共享信息以便他们向您发送有关其产品和服务的信息(后者需要您的事先同意)。'
								}

							]
						}, {
							title: '3、信息披露',
							content: [{
									child: '在如下情况下，本应用将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：'
								}, {
									child: '经您事先同意，向第三方披露；'
								}, {
									child: '为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；'
								},
								{
									child: '根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；'
								}, {
									child: '如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；'
								}, {
									child: '如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；在本应用平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，本应用有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。'
								}, {
									child: '其它本应用根据法律、法规或者网站政策认为合适的披露。'
								}

							]
						}, {
							title: '4、信息存储和交换',
							content: {
								child: '本应用收集的有关您的信息和资料将保存在本应用及(或)其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。'
							}
						}, {
							title: '5、Cookie的使用',
							content: [{
								child: '在您未拒绝接受cookies的情况下，本应用会在您的计算机上设定或取用cookies ，以便您能登录或使用依赖于cookies的本应用平台服务或功能。本应用使用cookies可为您提供更加周到的个性化服务，包括推广服务。'
							}, {
								child: '您有权选择接受或拒绝接受cookies；您可以通过修改浏览器设置的方式拒绝接受cookies；但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的本应用网络服务或功能。'
							}, {
								child: '通过本应用所设cookies所取得的有关信息，将适用本政策。'
							}]
						}, {
							title: '6、信息安全',
							content: [{
									child: '本应用帐号均有安全保护功能，请妥善保管您的用户名及密码信息。本应用将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在 “完善的安全措施”。'
								},
								{
									child: '在使用本应用网络服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是本应用用户名及密码发生泄露，请您立即联络本应用客服，以便本应用采取相应措施。'
								}
							]
						},
						{
							title: '7、本隐私政策的更改',
							content: [{
									child: '如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。'
								},
								{
									child: '本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公司会通过网站通知的形式告知。'
								}
							]
						}
					],
				}, ],
				current: 0, // tabs组件的current值，表示当前活动的tab选项
				swiperCurrent: 0, // swiper组件的current值，表示当前那个swiper-item是活动的

				tabsHeight: 0,
				dx: 0,
			}
		},
		onPageScroll(e) {
			this.scrollTop = e.scrollTop;
		},
		methods: {
			// tab栏切换
			change(index) {
				console.info('切换')
					console.info(index)
				this.swiperCurrent = index;
				
			},
			transition({
				detail: {
					dx
				}
			}) {
				this.$refs.tabs.setDx(dx);
			},
			animationfinish({
				detail: {
					current
				}
			}) {
				this.$refs.tabs.setFinishCurrent(current);
			}

		},
		// http配置请求
		onLoad(option) {
			//根据选项卡状态跳转对应下标
			this.current = option.type
			this.swiperCurrent = option.type
		}
	}
</script>

<style lang="scss" scoped>
	.agreement {
		position: relative;
		// padding-top: 51px;
		padding-bottom: 68px;

		.agreement_tab {
			width: 100%;
			position: fixed;
			top: 0px;
		}

		.agreement_content {
			padding-top: 41px;
			padding-left: 15px;
			padding-right: 15px;

			.content_title {
				// height: 20px;
				background: url(../../../../static/image/tit.png) no-repeat center;
				background-size: 250px 8px;
				display: flex;
				justify-content: center;
				font-size: 16px;
				font-family: PingFang SC;
				font-weight: bold;
				color: #3A3B3D;
				margin-bottom: 26px;

			}

			.content_box {
				.box_title {
					width: 100%;
					display: block;
					font-size: 14px;
					color: #3A3B3D;
					line-height: 28px;
					font-family: PingFang-SC-Bold;
					font-weight: bold;
				}

				.box_content {
					width: 100%;
					display: block;
					font-size: 13px;
					color: #3A3B3D;
					line-height: 28px;
					font-weight: Regular;
					font-family: PingFang-SC-Bold;
				}
			}
		}

		.wrap {
			width: 40px;
			height: 40px;
			line-height: 43px;
			border-radius: 50%;
			border: 0.5px solid #6E7073;
			background-color: #6E7073;
			text-align: center;
			opacity: 0.2;
			position: fixed;
			right: 20px;
			bottom: 100px;

			.child_Rimage {
				width: 100%;
				height: 100%;
			}
		}
	}
</style>
